Installer/TInF-Installer/packages/nheri.simcenter.tinf/data/Examples/building/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    bottom
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    cylinder
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }

    inlet
    {
        type    fixedValue;
        value   $internalField;
    }

    outlet
    {
        type    zeroGradient;
    }

    side
    {
        type    slip;
    }

    top
    {
        type    slip;
    }

}

// ************************************************************************* //







